Revit 2018 API
DocumentEntryPoint.GetElement Method
Overload List
Name | Description
GetElement(String)
 Gets the Element referenced by a unique id string.
 (Inherited from Document.)
GetElement(ElementId)
 Gets the Element referenced by the input string name.
 (Inherited from Document.)
GetElement(Reference)
 Gets the Element referenced by the input reference.
 (Inherited from Document.)
See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace